
= メタバース開拓日誌こぼれ話

全力肯定彼氏くん開発秘話でもいいけど、まだ落ち着いてないので
https://note.com/o_ob/m/mde97459aa5eb


白井暁彦（作家）		

//image[https://assets.st-note.com/production/uploads/images/85654373/rectangle_large_type_2_08dedb0662bacb3ef18e5ac680efb023.jpeg?fit=bounds&quality=85&width=1280][test]{ 
//}

人工知能とともに絵を描くという行為が人類にどんな影響を与えているか(1)		
#メディア芸術祭 公募展中止、理由がわからなかったので徹底的に調べてみた。		
どうやら本気で終わるらしい - R5概算要求から読み解く #メディア芸術祭 の未来		
スマホでも使えるAI神絵師「Dream Studio」公式ガイドの和訳から学ぶ呪文の基本 #StableDiffusion		
人工知能とともに絵を描くという行為が人類にどんな影響を与えているか？(2)人類は働きたいか。自分で描きたいか。		
ジョイコンが壊れたら「自分で直そう」ゲーム機の修理からはじめる #STEAM教育 のススメ		
"さいごの"文化庁メディア芸術祭にいってきた #メディア芸術祭終わらないで		
文化庁メディア芸術祭の終了宣言についての意見まとめ		
「文化庁メディア芸術祭の終了宣言についての意見書」		
#AI神絵師本 神速リリースしました！		
フランス大使館を訪問しました		
週刊AI神絵師 2022/10/16-10/22 - NovelAIによる技術改善の詳細		
週刊AI神絵師 2022/10/23～10/29 - AI神絵師本発売開始 - ネガティブワード手法の分析が進む		
週刊AI神絵師 2022/10/30～11/5 - 元素法典 と #AI神絵師本 がリリースされる		
文化庁から(メディア芸術祭終了についての)お返事をいただきました		
Stable Diffusion 2.0 Release日本語参考訳		
dアカウントの魔境をみた		
ぼくのDiscordにAI神絵師を召喚した件(GradioBotリリース記念)		
OpenAIのCEO - Sam Altman CEO頭の中を覗いた		
VisualStudio CodeとGoogle Apps ScriptでChatGPT(gpt-3.5-turbo)をより安全快適に使う		
「生成AI市場の今後の話」講演まとめ		
 人間×機械×知能メタバースにおけるユーザーエクスペリエンスの研究開発はエンタメ技術からコミュニケーション、コンヴィヴィ技術へ。		
この春、新大学生の「PC購入のご案内」にMacがいたときにお父さんがとるべき態度とは。		
フランスでAITuber的な新作をデモします		
生成AIを使いこなす物書き業がオレオレ詐欺の被害者になった話		
SlidesGPTによって人類はパワポ生成から解放されるのか。		
ChatGPTはゲームを開発を手伝えるか		
ChatGPTにアイドルの曲を作詞作曲MIDI生成までさせてみた		
第1回 AI Art GrandPrix が素晴らしかった件		
ChatGPTでグラフィックスを生成する		
Quora「Poe」GPT-4をさわってみる		
幻の「うめきた新駅」、開業まえに行ってきた！ #うめきた #JR西日本		
カッとなってGPT-4で確定申告をスマートにした		
IVRC2023に「メタバース部門」ができるのでがんばって"後方彼氏ヅラ"して腕組みして応援した		
ぼくらは「シンギュラリティがはじまる場所」を知っている。		
OpenAI公式文書に基づきGPT4に「倫理的脱獄」を誑かす(たぶらかす)		
[論文]文化・技術・研究史で読み解く令和のメタバースの研究開発 - note版		
[mmm] Metaverse Mode Maker teaser - GREE VR Studio Laboratory - #LavalVirtual2023		
#AIと漫画 素敵な作品を紹介する		
「第1回ChatGPT選手権 LT大会」雑な資料まとめ #GPT_findy		
		
OpenAIサム・アルトマンCEO単独インタビュー（テレ東Biz）		
メタバース時代に学生を育てる価値とは		
大学の先輩がサハリンで撮り続けている		
ChatGPT時代、日本はどんなチャンスを持っているか？ #WBSのAI特番		
		
[プロンプト有]ChatGPTに飛行機予約を手伝ってもらう		
ChatGPT→LangChainをもくもく学習した話		
LangChainもくもく会-ザツソウで仕入れたデプロイ先情報など		
その手があったかREALITY、エイプリルフールにハンドトラッキング機能公開。指にかけるメタバース研究開発の歴史を振り返る		
AI爆発時代のクリエイターライフ		
シュンスケ式プロンプトの極意はとてもカンタンなことだった - Amazon検索QRコード生成サンプル付き		
[有料更新]何があっても全力肯定してくれる彼氏AIを作りました		
「メタバース開発もくもく会」開催します！ #VTC23		
ChatGPT選手権で「メタバース研究所のマネジメントプレイヤーが爆速で業務効率化している件」という登壇をしました #尊い業務外活動		
まだお花見できそうだね		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
博士課程の最中に子供産みました		
		
		
		
		
		
デジタルハリウッド大学大学院の新ラボプロジェクト「Creative AI Lab」		
AIサービス開発において開発しながら大事なことを書いていたらこんな時間に…		
		
		
メタバース研究者が考える生成AI時代のスピード感　#140秒でわかるメタバース開発TIPS 		
VRのタクソノミーに関する研究まとめ		
		
		
StabilityAIが東工大で講演を行っていたので聴講した（ぼくの感想）		
		
生成AI時代のカンブリア爆発を生き抜くために…連休は性癖を走らせるまえに(謝辞と補足)		
「生成AI利用のガイドライン」にモヤモヤしたクリエイター側のガードライン		
		
		
		
OpenAIの裏APIを叩いて利用状況を取得する		


shiraiブランチでiPadのworkingCopyで作業するテスト


「窓の杜」というメディアにおいては、WindowsPCをお仕事の効率化やホビーとして楽しむ、という原点に立ち返って楽しめている様子、そしてそこの楽しみ方は自由なんだなという原点が尊いと思いました。


https://twitter.com/o_ob/status/1653644014158221312


OpenAIの裏APIを叩いて利用状況を取得する｜しらいはかせ(作家) @o_ob #note https://note.com/o_ob/n/n07a27ca94475 


