
= メタバース開拓日誌こぼれ話

個人的なLINEチャットボット「全力肯定彼氏くん開発秘話」と「ひまひま女子トモちゃん」開発秘話…でもいいのですが、まだ落ち着いてないので

//image[shirai-img/t0m0-poster20230505][]{
//}




白井暁彦（作家/Hacker）として毎日何かしら書いています。

「窓の杜」での連載もあるのですが、やっぱり商業メディアではなくパーソナルメディアでの業務外執筆は尊いもので、数えてみたら今回59本の原稿がありましたので、この一年の「メタバース開拓」のフロントラインにおける趣味開発をまとめて振り返ってみます。

なお要約にはChatGPT3.5を利用しており、QRコードはnote記事へのリンクとなっております。
ご感想はTwitter @o_ob までいただければ幸いです。

== 2022年8月 - Stable Diffusion と出会う

メディア芸術祭が終わると聞いて、本当にショックでした。

このショックな話をブログにしながら、Stable Diffusionの同人誌（技術書典部誌Vol.4）を50ページ書いていたという記憶があります。


=== 白井暁彦（作家） (2022-08-28)

白井暁彦は、工学博士であり、著述業、研究者、教育者、映像プロデューサー、VTuber配信など、多岐にわたる分野で活躍する「作家・メディア芸術」です。最近はGREE VR Studio LaboratoryでXRライブエンタメ事業を推進するREALITY株式会社で働きながら、デジタルハリウッド大学大学院客員教授も務めています。また、自身の経験をマンガで表現しています。

//image[shirai-img/2022-08-28-1][白井暁彦（作家）]{ 
//}

=== 人工知能とともに絵を描くという行為が人類にどんな影響を与えているか(1) (2022-08-28)

のちの「AIとコラボして神絵師になる」の原稿のきっかけになったエントリーです。

確かこの日は金曜ロードショウで『魔女の宅急便』をやっていて、それを見ながら画像生成のテーマにしていました。



//image[shirai-img/2022-08-28][人工知能とともに絵を描くという行為が人類にどんな影響を与えているか(1)]{ 
//}

=== #メディア芸術祭 公募展中止、理由がわからなかったので徹底的に調べてみた。 (2022-08-29)

//image[shirai-img/2022-08-29][#メディア芸術祭 公募展中止、理由がわからなかったので徹底的に調べてみた。]{ 
//}


== 2022年9月 - 技術書典13が9月11日に開催される

技術書典部員をはじめて生で見ました。
翌日の9月12日に、インプレスの編集者から「Stable Diffusionの商業書籍を書かないか」というオファーをいただきました。

夏休みをぶち捨てて書いた50ページの原稿、そこから最終的に210ページにするまでの期間です。

=== どうやら本気で終わるらしい - R5概算要求から読み解く #メディア芸術祭 の未来 (2022-09-01)

//image[shirai-img/2022-09-01][どうやら本気で終わるらしい - R5概算要求から読み解く #メディア芸術祭 の未来]{ 
//}

=== スマホでも使えるAI神絵師「Dream Studio」公式ガイドの和訳から学ぶ呪文の基本 #StableDiffusion (2022-09-03)

//image[shirai-img/2022-09-03][スマホでも使えるAI神絵師「Dream Studio」公式ガイドの和訳から学ぶ呪文の基本 #StableDiffusion]{ 
//}

=== 人工知能とともに絵を描くという行為が人類にどんな影響を与えているか？(2)人類は働きたいか。自分で描きたいか。 (2022-09-04)

//image[shirai-img/2022-09-04][人工知能とともに絵を描くという行為が人類にどんな影響を与えているか？(2)人類は働きたいか。自分で描きたいか。]{ 
//}

=== ジョイコンが壊れたら「自分で直そう」ゲーム機の修理からはじめる #STEAM教育 のススメ (2022-09-21)

//image[shirai-img/2022-09-21][ジョイコンが壊れたら「自分で直そう」ゲーム機の修理からはじめる #STEAM教育 のススメ]{ 
//}

=== "さいごの"文化庁メディア芸術祭にいってきた #メディア芸術祭終わらないで (2022-09-24)

//image[shirai-img/2022-09-24][""さいごの""文化庁メディア芸術祭にいってきた #メディア芸術祭終わらないで]{ 
//}

== 2022年10月 - 商業書籍の校正作業がめちゃ忙しかった

852話さんとの対談パートが3万文字あって、それを8000字ぐらいに圧縮したりしました。
10月24日に「AIとコラボして神絵師になる - 論文から読み解くStable Diffusion」（https://ivtv.page.link/aisd）をリリースしました。

Stable Diffusionのリリースからちょうど2か月。我ながら速かった！

=== 文化庁メディア芸術祭の終了宣言についての意見まとめ (2022-10-23)

//image[shirai-img/2022-10-23][文化庁メディア芸術祭の終了宣言についての意見まとめ]{ 
//}

=== 「文化庁メディア芸術祭の終了宣言についての意見書」 (2022-10-23)

//image[shirai-img/2022-10-23][「文化庁メディア芸術祭の終了宣言についての意見書」]{ 
//}

=== #AI神絵師本 神速リリースしました！ (2022-10-24)

//image[shirai-img/2022-10-24][#AI神絵師本 神速リリースしました！]{ 
//}

== 2022年11月 - AI画像生成の世界が大爆発

もう「週刊」とかいってる場合じゃなくなってきました。
このころから人間が読んで理解できる速度を超え始めます。


=== フランス大使館を訪問しました (2022-11-02)

//image[shirai-img/2022-11-02][フランス大使館を訪問しました]{ 
//}

=== 週刊AI神絵師 2022/10/16-10/22 - NovelAIによる技術改善の詳細 (2022-11-08)

//image[shirai-img/2022-11-08][週刊AI神絵師 2022/10/16-10/22 - NovelAIによる技術改善の詳細]{ 
//}

=== 週刊AI神絵師 2022/10/23～10/29 - AI神絵師本発売開始 - ネガティブワード手法の分析が進む (2022-11-14)

//image[shirai-img/2022-11-14][週刊AI神絵師 2022/10/23～10/29 - AI神絵師本発売開始 - ネガティブワード手法の分析が進む]{ 
//}

=== 週刊AI神絵師 2022/10/30～11/5 - 元素法典 と #AI神絵師本 がリリースされる (2022-11-22)

//image[shirai-img/2022-11-22][週刊AI神絵師 2022/10/30～11/5 - 元素法典 と #AI神絵師本 がリリースされる]{ 
//}

=== 文化庁から(メディア芸術祭終了についての)お返事をいただきました (2022-11-25)

//image[shirai-img/2022-11-25][文化庁から(メディア芸術祭終了についての)お返事をいただきました]{ 
//}

=== Stable Diffusion 2.0 Release日本語参考訳 (2022-11-26)

//image[shirai-img/2022-11-26][Stable Diffusion 2.0 Release日本語参考訳]{ 
//}

== 2022年12月 - 若干のペースダウン

確かこのころは、仕事のほうも結構大変な状況で、いろいろ悩みながらGPTを触りはじめたころです。

=== dアカウントの魔境をみた (2022-12-01)

//image[shirai-img/2022-12-01][dアカウントの魔境をみた]{ 
//}

=== ぼくのDiscordにAI神絵師を召喚した件(GradioBotリリース記念) (2022-12-23)

//image[shirai-img/2022-12-23][ぼくのDiscordにAI神絵師を召喚した件(GradioBotリリース記念)]{ 
//}

== 2023年1月～2月 OpenAIにどっぷりはまっている時期

仕事のほうがめちゃ大変で、ブログのほうはなんと1か月以上お休みしています。

おそらく「表では書けない研究開発」をやっていたんだと思います。

=== OpenAIのCEO - Sam Altman CEO頭の中を覗いた (2023-01-30)

//image[shirai-img/2023-01-30][OpenAIのCEO - Sam Altman CEO頭の中を覗いた]{ 
//}

=== VisualStudio CodeとGoogle Apps ScriptでChatGPT(gpt-3.5-turbo)をより安全快適に使う (2023-03-05)

//image[shirai-img/2023-03-05][VisualStudio CodeとGoogle Apps ScriptでChatGPT(gpt-3.5-turbo)をより安全快適に使う]{ 
//}

=== 「生成AI市場の今後の話」講演まとめ (2023-03-06)

//image[shirai-img/2023-03-06][「生成AI市場の今後の話」講演まとめ]{ 
//}

===  人間×機械×知能メタバースにおけるユーザーエクスペリエンスの研究開発はエンタメ技術からコミュニケーション、コンヴィヴィ技術へ。 (2023-03-07)

//image[shirai-img/2023-03-07][ 人間×機械×知能メタバースにおけるユーザーエクスペリエンスの研究開発はエンタメ技術からコミュニケーション、コンヴィヴィ技術へ。]{ 
//}

=== この春、新大学生の「PC購入のご案内」にMacがいたときにお父さんがとるべき態度とは。 (2023-03-08)

//image[shirai-img/2023-03-08][この春、新大学生の「PC購入のご案内」にMacがいたときにお父さんがとるべき態度とは。]{ 
//}

=== フランスでAITuber的な新作をデモします (2023-03-09)

//image[shirai-img/2023-03-09][フランスでAITuber的な新作をデモします]{ 
//}

=== 生成AIを使いこなす物書き業がオレオレ詐欺の被害者になった話 (2023-03-10)

//image[shirai-img/2023-03-10][生成AIを使いこなす物書き業がオレオレ詐欺の被害者になった話]{ 
//}

=== SlidesGPTによって人類はパワポ生成から解放されるのか。 (2023-03-11)

//image[shirai-img/2023-03-11][SlidesGPTによって人類はパワポ生成から解放されるのか。]{ 
//}

=== ChatGPTはゲームを開発を手伝えるか (2023-03-12)

//image[shirai-img/2023-03-12][ChatGPTはゲームを開発を手伝えるか]{ 
//}

=== ChatGPTにアイドルの曲を作詞作曲MIDI生成までさせてみた (2023-03-12)

//image[shirai-img/2023-03-12][ChatGPTにアイドルの曲を作詞作曲MIDI生成までさせてみた]{ 
//}

=== 第1回 AI Art GrandPrix が素晴らしかった件 (2023-03-13)

//image[shirai-img/2023-03-13][第1回 AI Art GrandPrix が素晴らしかった件]{ 
//}

=== ChatGPTでグラフィックスを生成する (2023-03-14)

//image[shirai-img/2023-03-14][ChatGPTでグラフィックスを生成する]{ 
//}

=== Quora「Poe」GPT-4をさわってみる (2023-03-16)

//image[shirai-img/2023-03-16][Quora「Poe」GPT-4をさわってみる]{ 
//}

=== 幻の「うめきた新駅」、開業まえに行ってきた！ #うめきた #JR西日本 (2023-03-16)

//image[shirai-img/2023-03-16][幻の「うめきた新駅」、開業まえに行ってきた！ #うめきた #JR西日本]{ 
//}

=== カッとなってGPT-4で確定申告をスマートにした (2023-03-17)

//image[shirai-img/2023-03-17][カッとなってGPT-4で確定申告をスマートにした]{ 
//}

=== IVRC2023に「メタバース部門」ができるのでがんばって""後方彼氏ヅラ""して腕組みして応援した (2023-03-18)

//image[shirai-img/2023-03-18][IVRC2023に「メタバース部門」ができるのでがんばって""後方彼氏ヅラ""して腕組みして応援した]{ 
//}

=== ぼくらは「シンギュラリティがはじまる場所」を知っている。 (2023-03-19)

//image[shirai-img/2023-03-19][ぼくらは「シンギュラリティがはじまる場所」を知っている。]{ 
//}

=== OpenAI公式文書に基づきGPT4に「倫理的脱獄」を誑かす(たぶらかす) (2023-03-20)

//image[shirai-img/2023-03-20][OpenAI公式文書に基づきGPT4に「倫理的脱獄」を誑かす(たぶらかす)]{ 
//}

=== 【論文】文化・技術・研究史で読み解く令和のメタバースの研究開発 - note版 (2023-03-21)

//image[shirai-img/2023-03-21][【論文】文化・技術・研究史で読み解く令和のメタバースの研究開発 - note版]{ 
//}

=== 【mmm】 Metaverse Mode Maker teaser - GREE VR Studio Laboratory - #LavalVirtual2023 (2023-03-23)

//image[shirai-img/2023-03-23][【mmm】 Metaverse Mode Maker teaser - GREE VR Studio Laboratory - #LavalVirtual2023]{ 
//}

=== #AIと漫画 素敵な作品を紹介する (2023-03-24)

//image[shirai-img/2023-03-24][#AIと漫画 素敵な作品を紹介する]{ 
//}

=== 「第1回ChatGPT選手権 LT大会」雑な資料まとめ #GPT_findy (2023-03-24)

//image[shirai-img/2023-03-24][「第1回ChatGPT選手権 LT大会」雑な資料まとめ #GPT_findy]{ 
//}

===  (2023-03-24)

//image[shirai-img/2023-03-24][]{ 
//}

=== OpenAIサム・アルトマンCEO単独インタビュー（テレ東Biz） (2023-03-25)

//image[shirai-img/2023-03-25][OpenAIサム・アルトマンCEO単独インタビュー（テレ東Biz）]{ 
//}

=== メタバース時代に学生を育てる価値とは (2023-03-26)

//image[shirai-img/2023-03-26][メタバース時代に学生を育てる価値とは]{ 
//}

=== 大学の先輩がサハリンで撮り続けている (2023-03-27)

//image[shirai-img/2023-03-27][大学の先輩がサハリンで撮り続けている]{ 
//}

=== ChatGPT時代、日本はどんなチャンスを持っているか？ #WBSのAI特番 (2023-03-28)

//image[shirai-img/2023-03-28][ChatGPT時代、日本はどんなチャンスを持っているか？ #WBSのAI特番]{ 
//}



=== 【プロンプト有】ChatGPTに飛行機予約を手伝ってもらう (2023-03-29)

//image[shirai-img/2023-03-29][【プロンプト有】ChatGPTに飛行機予約を手伝ってもらう]{ 
//}

=== ChatGPT→LangChainをもくもく学習した話 (2023-03-30)

//image[shirai-img/2023-03-30][ChatGPT→LangChainをもくもく学習した話]{ 
//}

=== LangChainもくもく会-ザツソウで仕入れたデプロイ先情報など (2023-03-31)

//image[shirai-img/2023-03-31][LangChainもくもく会-ザツソウで仕入れたデプロイ先情報など]{ 
//}

=== その手があったかREALITY、エイプリルフールにハンドトラッキング機能公開。指にかけるメタバース研究開発の歴史を振り返る (2023-04-01)

//image[shirai-img/2023-04-01][その手があったかREALITY、エイプリルフールにハンドトラッキング機能公開。指にかけるメタバース研究開発の歴史を振り返る]{ 
//}

=== AI爆発時代のクリエイターライフ (2023-04-02)

//image[shirai-img/2023-04-02][AI爆発時代のクリエイターライフ]{ 
//}

=== シュンスケ式プロンプトの極意はとてもカンタンなことだった - Amazon検索QRコード生成サンプル付き (2023-04-03)

//image[shirai-img/2023-04-03][シュンスケ式プロンプトの極意はとてもカンタンなことだった - Amazon検索QRコード生成サンプル付き]{ 
//}

=== 何があっても全力肯定してくれる彼氏AIを作りました (2023-04-03)

この記事、有料設定なのですが、ものすごく人気でした。


//image[shirai-img/2023-04-03][何があっても全力肯定してくれる彼氏AIを作りました]{ 
//}

=== 「メタバース開発もくもく会」開催します！ #VTC23 (2023-04-04)

//image[shirai-img/2023-04-04][「メタバース開発もくもく会」開催します！ #VTC23]{ 
//}

=== ChatGPT選手権で「メタバース研究所のマネジメントプレイヤーが爆速で業務効率化している件」という登壇をしました #尊い業務外活動 (2023-04-05)

//image[shirai-img/2023-04-05][ChatGPT選手権で「メタバース研究所のマネジメントプレイヤーが爆速で業務効率化している件」という登壇をしました #尊い業務外活動]{ 
//}

=== まだお花見できそうだね (2023-04-06)

//image[shirai-img/2023-04-06][まだお花見できそうだね]{ 
//}


=== 博士課程の最中に子供産みました (2023-04-18)

//image[shirai-img/2023-04-18][博士課程の最中に子供産みました]{ 
//}


=== デジタルハリウッド大学大学院の新ラボプロジェクト「Creative AI Lab」 (2023-04-22)

//image[shirai-img/2023-04-22][デジタルハリウッド大学大学院の新ラボプロジェクト「Creative AI Lab」]{ 
//}

=== AIサービス開発において開発しながら大事なことを書いていたらこんな時間に… (2023-04-23)

//image[shirai-img/2023-04-23][AIサービス開発において開発しながら大事なことを書いていたらこんな時間に…]{ 
//}


=== メタバース研究者が考える生成AI時代のスピード感　#140秒でわかるメタバース開発TIPS  (2023-04-26)

//image[shirai-img/2023-04-26][メタバース研究者が考える生成AI時代のスピード感　#140秒でわかるメタバース開発TIPS ]{ 
//}

=== VRのタクソノミーに関する研究まとめ (2023-04-27)

//image[shirai-img/2023-04-27][VRのタクソノミーに関する研究まとめ]{ 
//}


=== StabilityAIが東工大で講演を行っていたので聴講した（ぼくの感想） (2023-04-30)

//image[shirai-img/2023-04-30][StabilityAIが東工大で講演を行っていたので聴講した（ぼくの感想）]{ 
//}


=== 生成AI時代のカンブリア爆発を生き抜くために…連休は性癖を走らせるまえに(謝辞と補足) (2023-05-02)

//image[shirai-img/2023-05-02][生成AI時代のカンブリア爆発を生き抜くために…連休は性癖を走らせるまえに(謝辞と補足)]{ 
//}

=== 「生成AI利用のガイドライン」にモヤモヤしたクリエイター側のガードライン (2023-05-03)

//image[shirai-img/2023-05-03][「生成AI利用のガイドライン」にモヤモヤしたクリエイター側のガードライン]{ 
//}


=== OpenAIの裏APIを叩いて利用状況を取得する (2023-05-07)

//image[shirai-img/2023-05-07][OpenAIの裏APIを叩いて利用状況を取得する]{ 
//}"

OpenAIの裏APIを叩いて利用状況を取得する｜しらいはかせ(作家) @o_ob #note https://note.com/o_ob/n/n07a27ca94475 


「窓の杜」というメディアにおいては、WindowsPCをお仕事の効率化やホビーとして楽しむ、という原点に立ち返って楽しめている様子、そしてそこの楽しみ方は自由なんだなという原点が尊いと思いました。


https://twitter.com/o_ob/status/1653644014158221312




