
= メタバース開拓日誌こぼれ話

個人的な「全力肯定彼氏くん開発秘話でもいいけど、まだ落ち着いてないので
https://note.com/o_ob/m/mde97459aa5eb


白井暁彦（作家/Hacker）として毎日何かしら書いています。

「窓の杜」での連載もあるのですが、やっぱり商業メディアではなくパーソナルメディアでの業務外執筆は尊いもので、数えてみたら今回59本の原稿がありましたのでまとめて振り返ってみます。

なお要約にはChatGPT3.5を利用しています。

=== 白井暁彦（作家） (2022-08-28)

白井暁彦は、工学博士であり、著述業、研究者、教育者、映像プロデューサー、VTuber配信など、多岐にわたる分野で活躍する「作家・メディア芸術」です。最近はGREE VR Studio LaboratoryでXRライブエンタメ事業を推進するREALITY株式会社で働きながら、デジタルハリウッド大学大学院客員教授も務めています。また、自身の経験をマンガで表現しています。

//image[shirai-img/S1][白井暁彦（作家）]{ 
//}

=== 人工知能とともに絵を描くという行為が人類にどんな影響を与えているか(1) (2022-08-28)

//image[shirai-img/S1][白井暁彦（作家）]{ 
//}


=== #メディア芸術祭 公募展中止、理由がわからなかったので徹底的に調べてみた。 (2022-08-29)
=== どうやら本気で終わるらしい - R5概算要求から読み解く #メディア芸術祭 の未来 (2022-09-01)
=== スマホでも使えるAI神絵師「Dream Studio」公式ガイドの和訳から学ぶ呪文の基本 #StableDiffusion (2022-09-03)
=== 人工知能とともに絵を描くという行為が人類にどんな影響を与えているか？(2)人類は働きたいか。自分で描きたいか。 (2022-09-04)
=== ジョイコンが壊れたら「自分で直そう」ゲーム機の修理からはじめる #STEAM教育 のススメ (2022-09-21)
=== "さいごの"文化庁メディア芸術祭にいってきた #メディア芸術祭終わらないで (2022-09-24)
=== 文化庁メディア芸術祭の終了宣言についての意見まとめ (2022-10-23)
=== 「文化庁メディア芸術祭の終了宣言についての意見書」 (2022-10-23)
=== #AI神絵師本 神速リリースしました！ (2022-10-24)
=== フランス大使館を訪問しました (2022-11-02)
=== 週刊AI神絵師 2022/10/16-10/22 - NovelAIによる技術改善の詳細 (2022-11-08)
=== 週刊AI神絵師 2022/10/23～10/29 - AI神絵師本発売開始 - ネガティブワード手法の分析が進む (2022-11-14)
=== 週刊AI神絵師 2022/10/30～11/5 - 元素法典 と #AI神絵師本 がリリースされる (2022-11-22)
=== 文化庁から(メディア芸術祭終了についての)お返事をいただきました (2022-11-25)
=== Stable Diffusion 2.0 Release日本語参考訳 (2022-11-26)
=== dアカウントの魔境をみた (2022-12-01)
=== ぼくのDiscordにAI神絵師を召喚した件(GradioBotリリース記念) (2022-12-23)
=== OpenAIのCEO - Sam Altman CEO頭の中を覗いた (2023-01-30)
=== VisualStudio CodeとGoogle Apps ScriptでChatGPT(gpt-3.5-turbo)をより安全快適に使う (2023-03-05)
=== 「生成AI市場の今後の話」講演まとめ (2023-03-06)
===  人間×機械×知能メタバースにおけるユーザーエクスペリエンスの研究開発はエンタメ技術からコミュニケーション、コンヴィヴィ技術へ。 (2023-03-07)
=== この春、新大学生の「PC購入のご案内」にMacがいたときにお父さんがとるべき態度とは。 (2023-03-08)
=== フランスでAITuber的な新作をデモします (2023-03-09)
=== 生成AIを使いこなす物書き業がオレオレ詐欺の被害者になった話 (2023-03-10)
=== SlidesGPTによって人類はパワポ生成から解放されるのか。 (2023-03-11)
=== ChatGPTはゲームを開発を手伝えるか (2023-03-12)
=== ChatGPTにアイドルの曲を作詞作曲MIDI生成までさせてみた (2023-03-12)
=== 第1回 AI Art GrandPrix が素晴らしかった件 (2023-03-13)
=== ChatGPTでグラフィックスを生成する (2023-03-14)
=== Quora「Poe」GPT-4をさわってみる (2023-03-16)
=== 幻の「うめきた新駅」、開業まえに行ってきた！ #うめきた #JR西日本 (2023-03-16)
=== カッとなってGPT-4で確定申告をスマートにした (2023-03-17)
=== IVRC2023に「メタバース部門」ができるのでがんばって"後方彼氏ヅラ"して腕組みして応援した (2023-03-18)
=== ぼくらは「シンギュラリティがはじまる場所」を知っている。 (2023-03-19)
=== OpenAI公式文書に基づきGPT4に「倫理的脱獄」を誑かす(たぶらかす) (2023-03-20)
=== [論文]文化・技術・研究史で読み解く令和のメタバースの研究開発 - note版 (2023-03-21)
=== [mmm] Metaverse Mode Maker teaser - GREE VR Studio Laboratory - #LavalVirtual2023 (2023-03-23)
=== #AIと漫画 素敵な作品を紹介する (2023-03-24)
=== 「第1回ChatGPT選手権 LT大会」雑な資料まとめ #GPT_findy (2023-03-24)
===  (2023-03-24)
=== OpenAIサム・アルトマンCEO単独インタビュー（テレ東Biz） (2023-03-25)
=== メタバース時代に学生を育てる価値とは (2023-03-26)
=== 大学の先輩がサハリンで撮り続けている (2023-03-27)
=== ChatGPT時代、日本はどんなチャンスを持っているか？ #WBSのAI特番 (2023-03-28)
===  (2023-03-28)
=== [プロンプト有]ChatGPTに飛行機予約を手伝ってもらう (2023-03-29)
=== ChatGPT→LangChainをもくもく学習した話 (2023-03-30)
=== LangChainもくもく会-ザツソウで仕入れたデプロイ先情報など (2023-03-31)
=== その手があったかREALITY、エイプリルフールにハンドトラッキング機能公開。指にかけるメタバース研究開発の歴史を振り返る (2023-04-01)
=== AI爆発時代のクリエイターライフ (2023-04-02)
=== シュンスケ式プロンプトの極意はとてもカンタンなことだった - Amazon検索QRコード生成サンプル付き (2023-04-03)
=== [有料更新]何があっても全力肯定してくれる彼氏AIを作りました (2023-04-03)
=== 「メタバース開発もくもく会」開催します！ #VTC23 (2023-04-04)
=== ChatGPT選手権で「メタバース研究所のマネジメントプレイヤーが爆速で業務効率化している件」という登壇をしました #尊い業務外活動 (2023-04-05)
=== まだお花見できそうだね (2023-04-06)
===  (2023-04-06)
===  (2023-04-07)
===  (2023-04-08)
===  (2023-04-09)
===  (2023-04-10)
===  (2023-04-10)
===  (2023-04-11)
===  (2023-04-11)
===  (2023-04-13)
===  (2023-04-13)
===  (2023-04-14)
===  (2023-04-15)
===  (2023-04-15)
===  (2023-04-16)
===  (2023-04-17)
=== 博士課程の最中に子供産みました (2023-04-18)
===  (2023-04-19)
===  (2023-04-19)
===  (2023-04-20)
===  (2023-04-20)
===  (2023-04-21)
=== デジタルハリウッド大学大学院の新ラボプロジェクト「Creative AI Lab」 (2023-04-22)
=== AIサービス開発において開発しながら大事なことを書いていたらこんな時間に… (2023-04-23)
===  (2023-04-24)
===  (2023-04-25)
=== メタバース研究者が考える生成AI時代のスピード感　#140秒でわかるメタバース開発TIPS  (2023-04-26)
=== VRのタクソノミーに関する研究まとめ (2023-04-27)
===  (2023-04-28)
===  (2023-04-29)
=== StabilityAIが東工大で講演を行っていたので聴講した（ぼくの感想） (2023-04-30)
===  (2023-05-01)
=== 生成AI時代のカンブリア爆発を生き抜くために…連休は性癖を走らせるまえに(謝辞と補足) (2023-05-02)
=== 「生成AI利用のガイドライン」にモヤモヤしたクリエイター側のガードライン (2023-05-03)
===  (2023-05-04)
===  (2023-05-05)
===  (2023-05-06)
=== OpenAIの裏APIを叩いて利用状況を取得する (2023-05-07)

OpenAIの裏APIを叩いて利用状況を取得する｜しらいはかせ(作家) @o_ob #note https://note.com/o_ob/n/n07a27ca94475 


「窓の杜」というメディアにおいては、WindowsPCをお仕事の効率化やホビーとして楽しむ、という原点に立ち返って楽しめている様子、そしてそこの楽しみ方は自由なんだなという原点が尊いと思いました。


https://twitter.com/o_ob/status/1653644014158221312




