
= メタバース開拓日誌こぼれ話

== 白井暁彦（作家/Hacker）として毎日何かしら書いています

白井暁彦（作家/Hacker）として毎日何かしら書いています。

「窓の杜」での連載もあるのですが、やっぱり商業メディアではなくパーソナルメディアでの「業務外執筆は尊いもの」で、数えてみたら今回60本近い原稿がありましたので、この一年の「メタバース開拓」のフロントラインにおける趣味開発をまとめて振り返ってみます。

//image[shirai-img/t0m0-poster20230505][ひまひま女子トモちゃん、友達募集中です]{
//}


個人的なGPTチャットボット「全力肯定彼氏くん開発秘話」と「ひまひま女子トモちゃん」開発秘話…でもいいのですが、まだ落ち着いてないので……そこに至るまでの話をします。


なお本編にも要約にも、執筆にはGPTは使っていません！

QRコードはnote記事へのリンクとなっております。
ご感想はTwitter @o_ob までいただければ幸いです。


== 2022年8月 - Stable Diffusion と出会う

メディア芸術祭が終わると聞いて、本当にショックでした。

このショックな話をブログにしながら、Stable Diffusionの同人誌（技術書典部誌Vol.4）を50ページ書いていたという記憶があります。


=== 白井暁彦（作家） (2022-08-28)

まず自己紹介です。白井暁彦は、工学博士であり、著述業、研究者、教育者、映像プロデューサー、VTuber配信など、多岐にわたる分野で活躍する作家です。
最近はGREE VR Studio LaboratoryでXRライブエンタメ事業を推進するREALITY株式会社で働きながら、デジタルハリウッド大学大学院客員教授も務めています。

//image[shirai-img/技術書典14_4][白井暁彦（作家）]{ 
//}

=== 人工知能とともに絵を描くという行為が人類にどんな影響を与えているか(1) (2022-08-28)

のちの「AIとコラボして神絵師になる」の原稿のきっかけになったエントリーです。

確かこの日は金曜ロードショウで『魔女の宅急便』をやっていて、それを見ながら画像生成のテーマにしていました。



//image[shirai-img/技術書典14_5][人工知能とともに絵を描くという行為が人類にどんな影響を与えているか(1)]{ 
//}

この当時はpixivにもAI生成画像を公開している人はほとんどいなくて、すごく人気になったことを覚えています。
1枚1枚、Photoshopでレタッチしてから公開していました。


=== #メディア芸術祭 公募展中止、理由がわからなかったので徹底的に調べてみた。 (2022-08-29)

//image[shirai-img/技術書典14_6][#メディア芸術祭 公募展中止、理由がわからなかったので徹底的に調べてみた。]{ 
//}


== 2022年9月 - 技術書典13が9月11日に開催される

技術書典部員をはじめて生で見ました。
翌日の9月12日に、インプレスの編集者から「Stable Diffusionの商業書籍を書かないか」というオファーをいただきました。
夏休みをぶち捨てて書いた50ページの原稿、そこから最終的に210ページにするまでの期間です。

=== どうやら本気で終わるらしい - R5概算要求から読み解く #メディア芸術祭 の未来 (2022-09-01)

//image[shirai-img/技術書典14_7][どうやら本気で終わるらしい - R5概算要求から読み解く #メディア芸術祭 の未来]{ 
//}

=== スマホでも使えるAI神絵師「Dream Studio」公式ガイドの和訳から学ぶ呪文の基本 #StableDiffusion (2022-09-03)

脳が発火する感覚。今でも覚えています。

//image[shirai-img/技術書典14_8][スマホでも使えるAI神絵師「Dream Studio」公式ガイドの和訳から学ぶ呪文の基本 #StableDiffusion]{ 
//}

=== 人工知能とともに絵を描くという行為が人類にどんな影響を与えているか？(2)人類は働きたいか。自分で描きたいか。 (2022-09-04)

//image[shirai-img/技術書典14_9][人工知能とともに絵を描くという行為が人類にどんな影響を与えているか？(2)人類は働きたいか。自分で描きたいか。]{ 
//}

=== ジョイコンが壊れたら「自分で直そう」ゲーム機の修理からはじめる #STEAM教育 のススメ (2022-09-21)

ちゃんと家族の時間も大切にしています。というかもうそろそろ精密機器の修理は息子に任せたい……（視力がつらい）

//image[shirai-img/技術書典14_10][ジョイコンが壊れたら「自分で直そう」ゲーム機の修理からはじめる #STEAM教育 のススメ]{ 
//}

=== "さいごの"文化庁メディア芸術祭にいってきた #メディア芸術祭終わらないで (2022-09-24)

//image[shirai-img/技術書典14_11][「あつまるな！やまひょうと森」という作品]{ 
//}

== 2022年10月 - 商業書籍の校正作業がめちゃ忙しかった

852話さんとの対談パートが3万文字あって、それを8000字ぐらいに圧縮したりしました。
10月24日に「AIとコラボして神絵師になる - 論文から読み解くStable Diffusion」（https://ivtv.page.link/aisd）をリリースしました。

Stable Diffusionのリリースからちょうど2か月。我ながら速かった！

=== 文化庁メディア芸術祭の終了宣言についての意見まとめ (2022-10-23)

タグクラウドをつかって有志のアンケートをまとめさせていただきました。

//image[shirai-img/技術書典14_12][文化庁メディア芸術祭の終了宣言についての意見まとめ]{ 
//}

=== 「文化庁メディア芸術祭の終了宣言についての意見書」 (2022-10-23)

皆さんからの意見をまとめて、文化庁と文科省にお送りしました。

//image[shirai-img/技術書典14_13][「文化庁メディア芸術祭の終了宣言についての意見書」]{ 
//}

=== #AI神絵師本 神速リリースしました！ (2022-10-24)

いや本当に大変だった（軽く体壊しました）。

//image[shirai-img/技術書典14_14][#AI神絵師本 神速リリースしました！]{ 
//}

== 2022年11月 - AI画像生成の世界が大爆発

もう「週刊」とかいってる場合じゃなくなってきました。
このころから人間が読んで理解できる速度を超え始めます。


=== フランス大使館を訪問しました (2022-11-02)

「IVRC2022」国際学生VRコンテスト関係です。楽しそうにしていますが、けっこう泣きそうな忙しさ。

//image[shirai-img/技術書典14_15][フランス大使館を訪問しました]{ 
//}

=== 週刊AI神絵師 2022/10/16-10/22 - NovelAIによる技術改善の詳細 (2022-11-08)

//image[shirai-img/技術書典14_16][週刊AI神絵師 2022/10/16-10/22 - NovelAIによる技術改善の詳細]{ 
//}

=== 週刊AI神絵師 2022/10/23～10/29 - AI神絵師本発売開始 - ネガティブワード手法の分析が進む (2022-11-14)

「AI神絵師本」ついに10月28日 配信開始。特別生番組を企画。
「AIとコラボして神絵師になる　論文から読み解くStable Diffusion」白井暁彦 (著) > 本書は、今話題沸騰中のAIによる画像生成の仕組みや使い方について、中学生でも理解できることを目指し、わかりやすい説明で紹介した解説書です。難しい数式を全く使用せずにAI画像生成技術の最先端を科学コミュニケーターである著者がやさしい口調で解説しています。またより深く知識を得たい読者のために、Pythonでのサンプルコード、プロンプトの基礎や出力例、AI画像生成の法的な側面、実際の仕事で使ったユースケースも掲載。表紙イラストもAIで生成しており、担当イラストレーター・852話氏と著者の対談も掲載しています。先端技術を使いこなして、AI神絵師になるための「冒険の書」です！（出版社の書誌情報より）

 * 出版社のポータル https://nextpublishing.jp/book/15689.html
 * 印刷版予約URL https://ivtv.page.link/ap
 * Kindle版予約URL https://ivtv.page.link/ak

出版を記念して、VTuberよーへんさんが記念番組を企画してくださいました。

* #AI神絵師本 「AIとコラボして神絵師になる論文から読み解くStable Diffusion」発売記念配信〜あなたは何を創るのか？

https://youtu.be/GpvI_NC3ggU

//image[shirai-img/技術書典14_17][https://note.com/o_ob/n/ncbc6b346b697]{ 
//}

=== 週刊AI神絵師 2022/10/30～11/5 - 元素法典 と #AI神絵師本 がリリースされる (2022-11-22)

//image[shirai-img/技術書典14_18][週刊AI神絵師 2022/10/30～11/5 - 元素法典 と #AI神絵師本 がリリースされる]{ 
//}

=== 文化庁から(メディア芸術祭終了についての)お返事をいただきました (2022-11-25)

//image[shirai-img/技術書典14_19][文化庁から(メディア芸術祭終了についての)お返事をいただきました]{ 
//}

=== Stable Diffusion 2.0 Release日本語参考訳 (2022-11-26)

//image[shirai-img/技術書典14_20][Stable Diffusion 2.0 Release日本語参考訳]{ 
//}

== 2022年12月 - 若干のペースダウン

確かこのころは、仕事のほうも結構大変な状況で、いろいろ悩みながらGPTを触りはじめたころです。

=== dアカウントの魔境をみた (2022-12-01)

//image[shirai-img/技術書典14_21][dアカウントの魔境をみた]{ 
//}

=== ぼくのDiscordにAI神絵師を召喚した件(GradioBotリリース記念) (2022-12-23)

//image[shirai-img/技術書典14_22][ぼくのDiscordにAI神絵師を召喚した件(GradioBotリリース記念)]{ 
//}

== 2023年1月～2月 OpenAIにどっぷりはまっている時期

仕事のほうがめちゃ大変なのと、息子の受験と親の介護などがあって、ブログのほうはなんと1か月以上お休みしています。

仕事のほうも「表では書けない研究開発」をやっていたんだと思います。

=== OpenAIのCEO - Sam Altman CEO頭の中を覗いた (2023-01-30)

この記事もかなり読まれています。

//image[shirai-img/技術書典14_23][OpenAIのCEO - Sam Altman CEO頭の中を覗いた]{ 
//}

== 2023年3月 - GPT3.5を使いこなし勢いがついてくる

なんとこの時期、毎日書いています（計測記録上、連続投稿記録は途絶えてしまっていますが）。
OpenAIムーブメント、怒涛の時期ですね。
なお私の原稿はGPTは全然使っていません。だってプロだし……出てくる原稿がおもしろくないし……。

=== VisualStudio CodeとGoogle Apps ScriptでChatGPT(gpt-3.5-turbo)をより安全快適に使う (2023-03-05)

//image[shirai-img/技術書典14_24][VisualStudio CodeとGoogle Apps ScriptでChatGPT(gpt-3.5-turbo)をより安全快適に使う]{ 
//}

=== 「生成AI市場の今後の話」講演まとめ (2023-03-06)

//image[shirai-img/技術書典14_25][「生成AI市場の今後の話」講演まとめ]{ 
//}

===  人間×機械×知能メタバースにおけるユーザーエクスペリエンスの研究開発はエンタメ技術からコミュニケーション、コンヴィヴィ技術へ。 (2023-03-07)

2023年3月6日、日本機械学会で講演させていただきました。
正確には「日本機械学会(JSME)情報・知能・精密機器部門講演会(MSE&IIP)」という日本で最も歴史ある学会の「横糸」となる部門だそうです。情報・知能・精密機器部門の大きな分野には、情報機器コンピュータメカニクス、精密機構マイクロメカトロニクス、機械の知能化、医療福祉機器、マイクロエネルギーなどがあります。

さすがに、東京工業大学の知能システム科学を精密工学研究所の研究室の卒業で出たとはいえ、聴衆の皆様に腑落ちするお話ができるかどうか…不安がなかったかといえばそんなことはないです。事前にオーガナイザーの先生と綿密に論点をディスカッションさせていただいたうえで、ちょうど100ページぐらいのスライドを準備させていただきました。

けっこう資料価値高いと思いますので、ぜひ読んでほしい！
（資料の準備にご協力いただいたグリー広報およびXRC株式会社のみなさんありがとうございます！）

//image[shirai-img/技術書典14_26][ 人間×機械×知能メタバースにおけるユーザーエクスペリエンスの研究開発はエンタメ技術からコミュニケーション、コンヴィヴィ技術へ。]{ 
//}

=== この春、新大学生の「PC購入のご案内」にMacがいたときにお父さんがとるべき態度とは。 (2023-03-08)

息子が大学に進学するたびにバズってしまうこのネタ……みなさんのお子さんでもぜひご検討ください。

//image[shirai-img/技術書典14_27][この春、新大学生の「PC購入のご案内」にMacがいたときにお父さんがとるべき態度とは。]{ 
//}

=== フランスでAITuber的な新作をデモします (2023-03-09)

//image[shirai-img/技術書典14_28][フランスでAITuber的な新作をデモします]{ 
//}

=== 生成AIを使いこなす物書き業がオレオレ詐欺の被害者になった話 (2023-03-10)

いやあ……これは本当にひどかった。オレオレ詐欺ゆるすまじ！

//image[shirai-img/技術書典14_29][生成AIを使いこなす物書き業がオレオレ詐欺の被害者になった話]{ 
//}

=== SlidesGPTによって人類はパワポ生成から解放されるのか。 (2023-03-11)

今回の原稿で、パワポ制作どころか、原稿の制作ワークフローもずいぶん変わりました。

//image[shirai-img/技術書典14_30][SlidesGPTによって人類はパワポ生成から解放されるのか。]{ 
//}

=== ChatGPTはゲームを開発を手伝えるか (2023-03-12)

このあとけっこうGPTを使ったゲームが出てきたので、先行してPoC出来た感じはしますね。

//image[shirai-img/技術書典14_31][ChatGPTはゲームを開発を手伝えるか]{ 
//}

=== ChatGPTにアイドルに提供する曲を作詞作曲MIDI生成までさせてみた (2023-03-12)

//image[shirai-img/技術書典14_32][ChatGPTにアイドルに提供する曲を作詞作曲MIDI生成までさせてみた]{ 
//}

=== 第1回 AI Art GrandPrix が素晴らしかった件 (2023-03-13)

//image[shirai-img/技術書典14_33][第1回 AI Art GrandPrix が素晴らしかった件]{ 
//}

=== ChatGPTでグラフィックスを生成する (2023-03-14)

//image[shirai-img/技術書典14_34][ChatGPTでグラフィックスを生成する]{ 
//}

=== Quora「Poe」GPT-4をさわってみる (2023-03-16)

//image[shirai-img/技術書典14_35][Quora「Poe」GPT-4をさわってみる]{ 
//}

=== 幻の「うめきた新駅」、開業まえに行ってきた！ #うめきた #JR西日本 (2023-03-16)

//image[shirai-img/技術書典14_36][幻の「うめきた新駅」、開業まえに行ってきた！ #うめきた #JR西日本]{ 
//}

=== カッとなってGPT-4で確定申告をスマートにした (2023-03-17)

これもかなり読まれた記事です。来年の確定申告では実用化レベルに達しているのだろうか！？

//image[shirai-img/技術書典14_37][カッとなってGPT-4で確定申告をスマートにした]{ 
//}

=== IVRC2023に「メタバース部門」ができるのでがんばって"後方彼氏ヅラ"して腕組みして応援した (2023-03-18)

//image[shirai-img/技術書典14_38][IVRC2023に「メタバース部門」ができるのでがんばって"後方彼氏ヅラ"して腕組みして応援した]{ 
//}

=== ぼくらは「シンギュラリティがはじまる場所」を知っている。 (2023-03-19)

//image[shirai-img/技術書典14_39][ぼくらは「シンギュラリティがはじまる場所」を知っている。]{ 
//}

=== OpenAI公式文書に基づきGPT4に「倫理的脱獄」を誑かす(たぶらかす) (2023-03-20)

//image[shirai-img/技術書典14_40][OpenAI公式文書に基づきGPT4に「倫理的脱獄」を誑かす(たぶらかす)]{ 
//}

=== 【論文】文化・技術・研究史で読み解く令和のメタバースの研究開発 - note版 (2023-03-21)


//image[shirai-img/技術書典14_41][【論文】文化・技術・研究史で読み解く令和のメタバースの研究開発 - note版]{ 
//}

=== 【mmm】 Metaverse Mode Maker teaser - GREE VR Studio Laboratory - #LavalVirtual2023 (2023-03-23)

//image[shirai-img/mmm][【mmm】 Metaverse Mode Maker teaser - GREE VR Studio Laboratory - #LavalVirtual2023]{ 
//}

これはフランスで公開したティザー動画の紹介になります。

ごくごく珍しくお仕事の話をしていますね。

https://vr.gree.net/lab/uxdev/mmm/

メタバース・モードメーカーは、メタバース「REALITY」における新しいUGC-UXの概念実証プロジェクトです。

モード（ファッションコーディネート）におけるユーザー生成コンテンツ（UGC）に着目し、生成型AIによってユーザーのインスピレーションとモーションをサポートします。
ユーザーは、REALITY.アプリ上でベースとなるスタイルを選択します。そして、それをVRでデザインしたいと思うかもしれません。
でも、本当にテクスチャを全部描きたいですか？VRで？

今回のデモプロジェクトでは、AIを活用した新しいファッションコーディネートシステムをご覧いただけます。
VRの中で新しいデザインに参加することができ、公開されたデザインはデータベースで共有されるので、オリジナリティを保護することができます。

また、メタクエストのモーションキャプチャーツール「QueTra」を使って、上半身のアニメーションを作成することができます。また、SONYの新しいモバイルモーションキャプチャーデバイス「mocopi」も使用予定です。
AI Fusion技術により、美しい歩行モーションと融合させ、上半身のパフォーマンスを表現します。
また、オリジナルのデザインやモーションで音楽劇を表現することもできます。
また、VibeShare YouTubeLiveによるオンライン投票により、世界中から応援を受けることができます！

このプロジェクトは、アバター主導のUGCを実現し、メタバースの未来価値を高めるとともに、人々の創造性を高め、パーソナルブランドや非言語・異文化コミュニケーションを発展させることを目的としています。
私たちは常につながっていました。
これから先、私たちはどこで、誰と、どのようにつながっていくのでしょうか。

=== #AIと漫画 素敵な作品を紹介する (2023-03-24)

//image[shirai-img/技術書典14_42][#AIと漫画 素敵な作品を紹介する]{ 
//}

=== 「第1回ChatGPT選手権 LT大会」雑な資料まとめ #GPT_findy (2023-03-24)

//image[shirai-img/技術書典14_43][「第1回ChatGPT選手権 LT大会」雑な資料まとめ #GPT_findy]{ 
//}

=== メタバース時代に学生を育てる価値とは (2023-03-26)

//image[shirai-img/技術書典14_44][メタバース時代に学生を育てる価値とは]{ 
//}

=== 大学の先輩がサハリンで撮り続けている (2023-03-27)

//image[shirai-img/技術書典14_45][大学の先輩がサハリンで撮り続けている]{ 
//}

実は自分は写真の出身でありました。

=== 【プロンプト有】ChatGPTに飛行機予約を手伝ってもらう (2023-03-29)

//image[shirai-img/技術書典14_47][【プロンプト有】ChatGPTに飛行機予約を手伝ってもらう]{ 
//}

=== ChatGPT→LangChainをもくもく学習した話 (2023-03-30)

//image[shirai-img/技術書典14_48][ChatGPT→LangChainをもくもく学習した話]{ 
//}

=== LangChainもくもく会-ザツソウで仕入れたデプロイ先情報など (2023-03-31)

//image[shirai-img/技術書典14_49][LangChainもくもく会-ザツソウで仕入れたデプロイ先情報など]{ 
//}

== 2023年4月 - フランス出張の準備をしながら「尊い業務外開発」が進む


=== その手があったかREALITY、エイプリルフールにハンドトラッキング機能公開。指にかけるメタバース研究開発の歴史を振り返る (2023-04-01)

//image[shirai-img/技術書典14_50][その手があったかREALITY、エイプリルフールにハンドトラッキング機能公開。指にかけるメタバース研究開発の歴史を振り返る]{ 
//}

ごくごくまれにお仕事の紹介を書きました。
手が……手が動くようになったんです！！
5年にわたる開発の歴史を振り返っています。


=== AI爆発時代のクリエイターライフ (2023-04-02)

//image[shirai-img/技術書典14_51][AI爆発時代のクリエイターライフ]{ 
//}

=== シュンスケ式プロンプトの極意はとてもカンタンなことだった - Amazon検索QRコード生成サンプル付き (2023-04-03)

//image[shirai-img/技術書典14_52][シュンスケ式プロンプトの極意はとてもカンタンなことだった - Amazon検索QRコード生成サンプル付き]{ 
//}

=== 何があっても全力肯定してくれる彼氏AIを作りました (2023-04-03)

この記事、有料設定なのですが、ものすごく人気でした。


//image[shirai-img/技術書典14_53][何があっても全力肯定してくれる彼氏AIを作りました]{ 
//}

=== 「メタバース開発もくもく会」開催します！ #VTC23 (2023-04-04)

//image[shirai-img/技術書典14_54][「メタバース開発もくもく会」開催します！ #VTC23]{ 
//}

=== ChatGPT選手権で「メタバース研究所のマネジメントプレイヤーが爆速で業務効率化している件」という登壇をしました #尊い業務外活動 (2023-04-05)

「尊い業務外活動」です！流行らせていきたい！


//image[shirai-img/技術書典14_55][ChatGPT選手権で「メタバース研究所のマネジメントプレイヤーが爆速で業務効率化している件」という登壇をしました #尊い業務外活動]{ 
//}

=== まだお花見できそうだね (2023-04-06)


GPT実験チャットボット「LuC4」です。この時点で7,000人ぐらいフレンドがいた気がする。
実験的に作ってみたものですが、非常に人気なのでちゃんとメンテナンスしています。学ぶことが多かった……そのうち記事にするかもしれない。


//image[shirai-img/技術書典14_56][まだお花見できそうだね]{ 
//}


この期間はフランス「Laval Virtual 2023」で展示をやっていたので主にインスタです。

https://www.instagram.com/virtual_akihiko/

=== 博士課程の最中に子供産みました (2023-04-18)

なんかTwitterのタイムラインで「博士課程の最中に子供を産むのはケシカラン」という風潮を見てしまったんですよね……。
元投稿は消えてしまったのですが、しっかり書かせていただきました。多くの人から共感をいただきました。

後日、息子（本人）から軽く感想もらった……。そういうことなんですよね……。
社会のパタニティハラスメントは、すぐに社会に跳ね返ってきますよ～。

//image[shirai-img/技術書典14_57][博士課程の最中に子供産みました]{ 
//}


=== デジタルハリウッド大学大学院の新ラボプロジェクト「Creative AI Lab」 (2023-04-22)

//image[shirai-img/技術書典14_58][デジタルハリウッド大学大学院の新ラボプロジェクト「Creative AI Lab」]{ 
//}

=== AIサービス開発において開発しながら大事なことを書いていたらこんな時間に… (2023-04-23)

//image[shirai-img/技術書典14_59][AIサービス開発において開発しながら大事なことを書いていたらこんな時間に…]{ 
//}


=== メタバース研究者が考える生成AI時代のスピード感　#140秒でわかるメタバース開発TIPS  (2023-04-26)

//image[shirai-img/技術書典14_60][メタバース研究者が考える生成AI時代のスピード感　#140秒でわかるメタバース開発TIPS ]{ 
//}

=== VRのタクソノミーに関する研究まとめ (2023-04-27)

こういったブログも毎日書いているのですが、この横で、真面目に論文を書いています。時々そういう論文が海外でキャッチアップされたりします。

//image[shirai-img/技術書典14_61][VRのタクソノミーに関する研究まとめ]{ 
//}


=== StabilityAIが東工大で講演を行っていたので聴講した（ぼくの感想） (2023-04-30)

//image[shirai-img/技術書典14_62][StabilityAIが東工大で講演を行っていたので聴講した（ぼくの感想）]{ 
//}


=== 生成AI時代のカンブリア爆発を生き抜くために…連休は性癖を走らせるまえに(謝辞と補足) (2023-05-02)

//image[shirai-img/技術書典14_63][生成AI時代のカンブリア爆発を生き抜くために…連休は性癖を走らせるまえに(謝辞と補足)]{ 
//}

=== 「生成AI利用のガイドライン」にモヤモヤしたクリエイター側のガードライン (2023-05-03)

//image[shirai-img/技術書典14_64][「生成AI利用のガイドライン」にモヤモヤしたクリエイター側のガードライン]{ 
//}

その後、柿沼弁護士から「フィードバックさせていただきますね！」というDMをいただきました。書いてよかった。

=== OpenAIの裏APIを叩いて利用状況を取得する (2023-05-07)

//image[shirai-img/技術書典14_65][OpenAIの裏APIを叩いて利用状況を取得する]{ 
//}

なんかもうこれだけで技術書が書けるネタがありますね……。
あとは趣味でStripeAPIを叩いてみたりもしています。


== 振り返り「尊い業務外活動」！

尊い業務外活動ですが、振り返ってみると、まあ本当に忙しいのに毎日よく書いたなあと。
表紙絵も途中からオリジナルになっているのでこれもよく描いたなあと……本原稿で並べて見ることができたのでちょっと満足です。

 * 窓の杜連載「いまからでも遅くない！ツールとして使うAI画像生成」（全4回）
 * https://forest.watch.impress.co.jp/docs/shseri/toolsd/1459368.html

それから、この原稿や論文、特許や国際会議、業務の開発以外にも、もちろんマネジメントタスクもありますし、両親が入院したり、オレオレ詐欺にあったり、息子が受験だったり（高専に受かりました！やったね）、あとは「窓の杜」の連載などもやっておりました。

「窓の杜」さんはとても歴史あるWebメディアですが、WindowsPCをお仕事の効率化やホビーとして楽しむ、という原点に立ち返って楽しめている様子、そしてそこの楽しみ方は自由なんだなという原点が尊いと思いました。新連載も始まります。

ブログというパーソナルメディアにおいても毎日バリバリ書いてきてよかったです。

== この原稿を生成した Google Apps Script たち

昔からこういう原稿生成スクリプトを作りたかったのですが、今回、60件近いブログ（実際には「つぶやき」もあるので90件超え）を処理するため、Google Apps Scriptを作りました。

いちおう「技術書」なんで、スプレッドシートに記載されたURL、カバー画像、QRコードをGoogleSlides化するコードを共有しておきますね！

//listnum[Google Apps Script 1][noteの自分の記事一覧をスプレッドシートに取得する]{
// 参考にしたコード https://note.com/specially198/n/n7ed537c0bb4c
function getNoteArticles() {
 const userName = "o_ob";
 const url=`https://note.com/api/v2/creators/${userName}/contents?kind=note`;
 // APIで記事を取得する
 let jsonArticleInfo = UrlFetchApp.fetch(url, {'method':'get'});
 let articleInfos = JSON.parse(jsonArticleInfo.getContentText());
 let output = makeOutput(articleInfos.data.contents);
 // 記事数が2ページ以上ある場合は、総ページ数分、繰り返し処理する
 if (!articleInfos.data.isLastPage) {
   let page = 2;
   while(true) {
     jsonArticleInfo=UrlFetchApp.fetch(`${url}&page=${page}`,{'method':'get'});
     articleInfos = JSON.parse(jsonArticleInfo.getContentText());
     let tmp = makeOutput(articleInfos.data.contents);
     output = output.concat(tmp);
     if (articleInfos.data.isLastPage) {
       break;
     }
     page++;
   }
 }
 let sheetNoteArticleList = SpreadsheetApp
  .getActiveSpreadsheet().getSheetByName('note記事一覧');
 sheetNoteArticleList.getRange(2, 1, output.length,
  output[0].length).setValues(output);
}
//spreadsheetに一覧を作ります
function makeOutput(contents) {
 let output = [];
 for (let articleInfo of contents) {
   let row = [];
   row.push(articleInfo.publishAt);
   row.push(articleInfo.noteUrl);
   row.push(articleInfo.eyecatch);
   row.push("https://chart.apis.google.com/chart?cht=qr&chs=450x450&chl="
    +articleInfo.noteUrl)
   row.push(articleInfo.name);
   row.push('=IMAGE("'+articleInfo.eyecatch+'")');
   row.push('=image("https://chart.apis.google.com/chart?
    cht=qr&chs=450x450&chl="&B2)')
   output.push(row);
 }
 return output;
}
//}

//image[shirai-img/ssindex][こうして生成されたスプレッドシート。QRコードもチェックできます。]{ 
//}

ここからOpenAIのAPIを叩いて各ブログアーティクルの概要とか作ってもいいのですが、それはやめておきます。
というのも、私のブログはめちゃ長いのでそんな簡単に要約できませんので……工夫が必要！

このスプレッドシートに記載されたURL、カバー画像、QRコードをGoogleSlides化します。
全部で65ページもあったので、手作業よりは開発したほうが速かったです（勝利！）。


//listnum[Google Apps Script 2][スプレッドシートからGoogleSlides化するコード]{

function insertImageToSheet() {
  //スプレッドシートに記載されたURL、カバー画像、QRコードをGoogleSlides化
  let presentation = SlidesApp.getActivePresentation()
  let slides = presentation.getSlides();
  // QRを左710に移動
  Logger.log(slides[1].getImages()[0].getLeft().toString());
  Logger.log(slides[1].getImages()[0].getTop().toString());
  slides[1].getImages()[0].setLeft(710); //QRを右に寄せたかった
  let ss = SpreadsheetApp.openById("(SpreadsheetのID)").getSheetByName("note記事一覧");
  var range = ss.getRange(2,2,94,4).getValues();
  for (let i=0; i<=94; i++) {
    Logger.log(range[i][0]); //URL
    Logger.log(range[i][1]); //cover
    Logger.log(range[i][2]); //QR
    Logger.log(range[i][3]); //title
   //タイトルとカバーがあるもののみ処理
    if ((range[i][3]!="")&&(range[i][1]!="")) {
     let QR_blob = UrlFetchApp.fetch(range[i][2]).getBlob();
     let slide = presentation.appendSlide(SlidesApp.PredefinedLayout.BLANK);
     slide.insertImage(QR_blob);
     let QR_object = slide.getImages()[0];
     QR_object.setLeft(710);
     let cover = UrlFetchApp.fetch(range[i][1]).getBlob();
     slide.insertImage(cover);
     slide.getNotesPage().getSpeakerNotesShape()
      .getText().appendText(range[i][3]+"\n"+range[i][0]);
    }
  }
//}

最後に、生成したスライドをPNG画像に変換します。これもスクリプトで処理しています。

//image[shirai-img/slideindex][こうして生成されたPNG画像たち。都合よくリネームする方法がわからないのでこれはスプレッドシート側でどうにかするか……]{ 
//}

//image[shirai-img/NijiJourney4]今回の表紙（のメイキング）]{ 
//}

プロンプトは毎日のnoteで公開してたりします。今回はこんな感じです。
//listnum[NijiJourney][NijiJourneyV5でのプロンプト]{
two girls in symmetry, a pink bud hair girl watching at camera, a cyan hair hacker exaggrated cute girl on the right, red half rig glasses, crawling to the keyboard, innocent eyes, curvey, attractive, neon colors, ultra realistic, highest quality --niji 5 --style expressive --ar 16:9
//}

//image[shirai-img/cover][今回の表紙（の素材）]{ 
//}


以上です、今回の部誌は、表紙もがんばっちゃったのですが、画像はAI生成、適切な引用、広告、などなど著作権には問題ないはず。
はたして広報さんの厳しいレビューを潜り抜けて印刷所にたどり着けるのだろうか！

さあみんなもレッツ「尊い業務外活動」！

（しらいはかせ／白井暁彦＠2023/5/11）
